{
    "version": "https://jsonfeed.org/version/1",
    "title": "Hacker News Summary",
    "home_page_url": "https://ruanyf.github.io/hnsummary",
    "feed_url": "https://ruanyf.github.io/hnsummary/rss.json",
    "description": "HN posts' summary",
    "icon": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b2/Y_Combinator_logo.svg/500px-Y_Combinator_logo.svg.png",
    "author": {
        "name": "Ruan Yifeng",
        "url": "https://www.ruanyifeng.com/blog"
    },
    "items": [
        {
            "id": "https://railsatscale.com/2023-08-29-ruby-outperforms-c/",
            "content_html": "<p>The article discusses the performance optimization of Ruby code by comparing it with C extensions. It presents a benchmark test of parsing GraphQL queries using the GraphQL Ruby gem and the Racc C extension. The results show that YJIT, a just-in-time compiler, can outperform the C extension when used with the pure Ruby implementation of Racc. The article also introduces TinyGQL, a pure Ruby GraphQL parser, which achieves faster performance than the C extension when combined with YJIT.\n            </p><p>\n                54 Points |  <a href=\"https://news.ycombinator.com/item?id=37422705\">31 comments</a>\n            </p>",
            "url": "https://railsatscale.com/2023-08-29-ruby-outperforms-c/",
            "title": "Ruby Outperforms C: Breaking the Catch-22 (railsatscale.com)",
            "summary": "'YJIT and Pure Ruby Implementation Outperform C Extension in Ruby Performance Optimization'",
            "date_modified": "2023-09-07T17:43:12.000Z",
            "author": {
                "name": "railsatscale.com"
            }
        },
        {
            "id": "https://discourse.julialang.org/t/julia-mojo-mandelbrot-benchmark/103638",
            "content_html": "<p>Julia code for calculating the Mandelbrot set is benchmarked against Mojo code. The Julia code takes 7.45 ms to run, while the Mojo code runs in 2.14 ms. Suggestions are made to improve the Julia code, such as using SIMD vectorization and decomposing complex numbers. The @simd macro is limited and cannot see through function calls. Differences between the Julia and Mojo code, such as the use of FP ranges, may also affect performance. Overall, the goal is to optimize the Julia code and potentially surpass the performance of the Mojo code.\n            </p><p>\n                72 Points |  <a href=\"https://news.ycombinator.com/item?id=37442064\">26 comments</a>\n            </p>",
            "url": "https://discourse.julialang.org/t/julia-mojo-mandelbrot-benchmark/103638",
            "title": "Julia and Mojo (Modular) Mandelbrot Benchmark (discourse.julialang.org)",
            "summary": "Optimizing Julia Code for Mandelbrot Set Calculation",
            "date_modified": "2023-09-09T03:42:53.000Z",
            "author": {
                "name": "discourse.julialang.org"
            }
        },
        {
            "id": "https://www.theguardian.com/science/2023/sep/07/nishimura-comet-could-be-visible-to-naked-eye-this-weekend",
            "content_html": "<p>Comet Nishimura, discovered just a month ago, could be visible to the naked eye this weekend, offering stargazers a rare opportunity. Most comets are discovered months or years before reaching peak visibility, but Nishimura is an exception. It swings by the sun every 437 years and spends most of its time in the outer solar system. The comet will pass closest to the sun on September 17th and will be easiest to observe in the northern hemisphere this Saturday and Sunday. Stargazers can look towards the north-eastern sky before sunrise, to the left of Venus, for the best view.\n            </p><p>\n                80 Points |  <a href=\"https://news.ycombinator.com/item?id=37413387\">21 comments</a>\n            </p>",
            "url": "https://www.theguardian.com/science/2023/sep/07/nishimura-comet-could-be-visible-to-naked-eye-this-weekend",
            "title": "Newly discovered comet Nishimura could be visible to naked eye this weekend (www.theguardian.com)",
            "summary": "Newly Discovered Comet Nishimura Could Be Visible to Naked Eye This Weekend",
            "date_modified": "2023-09-07T00:48:16.000Z",
            "author": {
                "name": "www.theguardian.com"
            }
        },
        {
            "id": "https://timotijhof.net/posts/2023/an-internet-of-php/",
            "content_html": "<p>PHP Continues to Dominate the Internet: Statistics and Anecdotes\n            </p><p>\n                14 Points |  <a href=\"https://news.ycombinator.com/item?id=37415747\">2 comments</a>\n            </p>",
            "url": "https://timotijhof.net/posts/2023/an-internet-of-php/",
            "title": "An Internet of PHP (timotijhof.net)",
            "summary": "PHP's Dominance in the Internet: Statistics and Anecdotes",
            "date_modified": "2023-09-07T07:23:33.000Z",
            "author": {
                "name": "timotijhof.net"
            }
        },
        {
            "id": "https://material.io/blog/2023-google-fonts-redesign",
            "content_html": "<p>Google Fonts has redesigned its website to provide better ways of exploring and finding fonts and icons. The updates include a new navigation rail, improved mobile experience, and a new sidebar for searching and filtering. The layout also introduces a new color palette for light and dark mode. Users can try out the new experience on fonts.google.com and provide feedback. The redesign aims to enhance the user experience and make it easier to find the right assets for projects.\n            </p><p>\n                41 Points |  <a href=\"https://news.ycombinator.com/item?id=37441683\">28 comments</a>\n            </p>",
            "url": "https://material.io/blog/2023-google-fonts-redesign",
            "title": "The new Google Fonts: find what you’re looking for (material.io)",
            "summary": "'Google Fonts Redesigns Website for Better Font and Icon Exploration'",
            "date_modified": "2023-09-09T02:38:22.000Z",
            "author": {
                "name": "material.io"
            }
        },
        {
            "id": "https://maizure.org/projects/decoded-gnu-coreutils/",
            "content_html": "<p>Decoding GNU coreutils is a long-term project that aims to provide a comprehensive understanding of the design and implementation of the command-line utilities in version 8.3. It is a valuable resource for novice programmers looking to explore the inner workings of these utilities. The project is divided into phases, with the first two phases already completed, focusing on providing an overview of each utility and discussing important design decisions. The project also covers the basic design patterns shared by most utilities, such as utility initialization, parsing with Getopt, traversing the file system with fts, and using syscall wrappers and helpers. The coreutils codebase is characterized by its simplicity, use of macros, and reliance on POSIX standards. Overall, this project offers valuable insights into the GNU coreutils and their implementation.\n            </p><p>\n                207 Points |  <a href=\"https://news.ycombinator.com/item?id=37439535\">54 comments</a>\n            </p>",
            "url": "https://maizure.org/projects/decoded-gnu-coreutils/",
            "title": "Decoded: GNU Coreutils (2018) (maizure.org)",
            "summary": "Decoding GNU coreutils: A Comprehensive Exploration of Command-Line Utilities",
            "date_modified": "2023-09-08T21:15:52.000Z",
            "author": {
                "name": "maizure.org"
            }
        },
        {
            "id": "https://blog.dataparty.xyz/blog/snoop-unto-them/",
            "content_html": "<p>DEFCON 31 has released official videos of their talks, including 'Snoop unto them as they snoop unto you'. The talk, slides, files, and code are available for download. The blog post also provides links to follow and support the speakers, including options to buy them a coffee, get their rfparty product, and connect on social media. The post ends with an invitation to join their Discord and sign up for their mailing list.\n            </p><p>\n                164 Points |  <a href=\"https://news.ycombinator.com/item?id=37440104\">86 comments</a>\n            </p>",
            "url": "https://blog.dataparty.xyz/blog/snoop-unto-them/",
            "title": "Snoop unto them as they snoop unto you (blog.dataparty.xyz)",
            "summary": "'DEFCON 31 Releases Official Videos and Offers Ways to Support Speakers'",
            "date_modified": "2023-09-08T22:26:51.000Z",
            "author": {
                "name": "blog.dataparty.xyz"
            }
        },
        {
            "id": "http://cm.bell-labs.co/who/dmr/chist.html",
            "content_html": "<p>This paper discusses the development of the C programming language, its influences, and the conditions under which it was created. It highlights the evolution of C from its parent language BCPL and its grandparent language BCPL. The paper also mentions the significant periods of changes in the language and its association with the Unix operating system. It concludes by noting that C has become one of the dominant languages in the computer industry today.\n            </p><p>\n                4 Points |  <a href=\"https://news.ycombinator.com/item?id=37442810\">0 comments</a>\n            </p>",
            "url": "http://cm.bell-labs.co/who/dmr/chist.html",
            "title": "The Development of the C Language (cm.bell-labs.co)",
            "summary": "'The Development and Evolution of the C Programming Language'",
            "date_modified": "2023-09-09T06:33:32.000Z",
            "author": {
                "name": "cm.bell-labs.co"
            }
        },
        {
            "id": "https://msprout.notion.site/LogoScale-A-Method-for-Vectorizing-Small-Crappy-Logos-dc0035b7473c44f8b94ffc4026d286c0",
            "content_html": "<p>N/A\n            </p><p>\n                149 Points |  <a href=\"https://news.ycombinator.com/item?id=37440631\">23 comments</a>\n            </p>",
            "url": "https://msprout.notion.site/LogoScale-A-Method-for-Vectorizing-Small-Crappy-Logos-dc0035b7473c44f8b94ffc4026d286c0",
            "title": "LogoScale – A method for vectorizing small, crappy logos (msprout.notion.site)",
            "summary": "N/A",
            "date_modified": "2023-09-08T23:38:39.000Z",
            "author": {
                "name": "msprout.notion.site"
            }
        },
        {
            "id": "https://today.ucsd.edu/story/forwarding_based_spoofing",
            "content_html": "<p>Email forwarding flaws allow scammers to impersonate high-profile domains, including government organizations, financial service companies, and major news organizations. The vulnerabilities in the email forwarding process bypass the safeguards of email providers like Gmail and Outlook, making it easier for attackers to send spoofed emails containing malware or spyware. The research team discovered that many organizations outsource their email infrastructure to third-party providers, which can be exploited through email forwarding. The vulnerabilities affect a significant number of domains, including state.gov, Mastercard, The Washington Post, and the Associated Press. While some providers have patched the issues, researchers recommend disabling open forwarding and implementing stricter validation policies to enhance email security.\n            </p><p>\n                163 Points |  <a href=\"https://news.ycombinator.com/item?id=37438478\">42 comments</a>\n            </p>",
            "url": "https://today.ucsd.edu/story/forwarding_based_spoofing",
            "title": "Scammers can exploit email forwarding flaws to impersonate high-profile domains (today.ucsd.edu)",
            "summary": "Email Forwarding Flaws Enable Scammers to Impersonate High-Profile Domains",
            "date_modified": "2023-09-08T19:45:08.000Z",
            "author": {
                "name": "today.ucsd.edu"
            }
        },
        {
            "id": "https://www.newyorker.com/culture/personal-history/the-power-of-food-for-people-with-dementia",
            "content_html": "<p>The Power of Food in Triggering Memories and Enhancing Quality of Life for People with Dementia\n            </p><p>\n                24 Points |  <a href=\"https://news.ycombinator.com/item?id=37413566\">2 comments</a>\n            </p>",
            "url": "https://www.newyorker.com/culture/personal-history/the-power-of-food-for-people-with-dementia",
            "title": "The Power of Food for People with Dementia (www.newyorker.com)",
            "summary": "The Transformative Role of Food for Individuals with Dementia",
            "date_modified": "2023-09-07T01:15:10.000Z",
            "author": {
                "name": "www.newyorker.com"
            }
        },
        {
            "id": "https://github.com/dancrossnyc/rxv64",
            "content_html": "<p>rxv64 is a pedagogical operating system written in Rust that targets multiprocessor x86_64 machines. It is a reimplementation of the xv6 operating system from MIT. The system supports very little hardware other than the text-mode CGA device, serial port, PS/2 keyboard controller, and PCIe AHCI SATA storage devices. The xv6 README provides more information on provenance and intended use.\n            </p><p>\n                107 Points |  <a href=\"https://news.ycombinator.com/item?id=37439391\">24 comments</a>\n            </p>",
            "url": "https://github.com/dancrossnyc/rxv64",
            "title": "The rxv64 Operating System: MIT's xv6, in Rust, for SMP x86_64 machines (github.com)",
            "summary": "'rxv64': A Pedagogical Operating System Reimplementation in Rust",
            "date_modified": "2023-09-08T21:03:19.000Z",
            "author": {
                "name": "github.com"
            }
        },
        {
            "id": "https://course.spacy.io/en/",
            "content_html": "<p>This course on spaCy, a Python library for Natural Language Processing, covers the basics of text processing, large-scale data analysis, processing pipelines, and training neural network models. It teaches you how to extract specific information from text, combine statistical and rule-based approaches, customize spaCy's models, and build advanced natural language understanding systems. The course is free and interactive, and is taught by Ines, one of the core developers of spaCy. She specializes in modern developer tools for AI, Machine Learning, and NLP.\n            </p><p>\n                6 Points |  <a href=\"https://news.ycombinator.com/item?id=37442574\">1 comments</a>\n            </p>",
            "url": "https://course.spacy.io/en/",
            "title": "Advanced NLP with SpaCy (course.spacy.io)",
            "summary": "Mastering Natural Language Processing with spaCy",
            "date_modified": "2023-09-09T05:36:22.000Z",
            "author": {
                "name": "course.spacy.io"
            }
        },
        {
            "id": "https://www.sciencedirect.com/science/article/pii/S0016706123003324#s0040",
            "content_html": "<p>The content you requested is not available. Please contact support for more information. The reference number, IP address, and timestamp are provided for reference. ScienceDirect uses cookies to enhance its service. Copyright information is also included.\n            </p><p>\n                74 Points |  <a href=\"https://news.ycombinator.com/item?id=37440482\">11 comments</a>\n            </p>",
            "url": "https://www.sciencedirect.com/science/article/pii/S0016706123003324#s0040",
            "title": "Morphology and temporal evolution of ground-nesting bee burrows (www.sciencedirect.com)",
            "summary": "Content Unavailable: Contact Support for Assistance",
            "date_modified": "2023-09-08T23:17:21.000Z",
            "author": {
                "name": "www.sciencedirect.com"
            }
        },
        {
            "id": "https://rafalcieslak.wordpress.com/2013/04/02/dynamic-linker-tricks-using-ld_preload-to-cheat-inject-features-and-investigate-programs/",
            "content_html": "<p>Using LD_PRELOAD to manipulate the behavior of applications without modifying their source code or recompiling them is a powerful trick in Linux. This technique allows users to inject custom code into applications transparently, such as modifying the behavior of the random number generator or intercepting file access calls. The blog post provides examples of how LD_PRELOAD can be used to cheat in games, investigate unknown applications by monitoring file I/O and internet access, and even create bullet-time effects in games. The author emphasizes that while this trick can be fun and useful for debugging, it should not be used to bypass security or gain root privileges.\n            </p><p>\n                128 Points |  <a href=\"https://news.ycombinator.com/item?id=37439125\">70 comments</a>\n            </p>",
            "url": "https://rafalcieslak.wordpress.com/2013/04/02/dynamic-linker-tricks-using-ld_preload-to-cheat-inject-features-and-investigate-programs/",
            "title": "Using LD_PRELOAD to cheat, inject features and investigate programs (rafalcieslak.wordpress.com)",
            "summary": "Manipulating Application Behavior with LD_PRELOAD: Fun and Useful Tricks in Linux",
            "date_modified": "2023-09-08T20:41:20.000Z",
            "author": {
                "name": "rafalcieslak.wordpress.com"
            }
        },
        {
            "id": "https://github.com/RuyiLi/cursed-typescript/blob/master/random/game-of-life.ts",
            "content_html": "<p>This is a TypeScript file containing code for a game of life simulation. The code is 203 lines long and has a file size of 7.24 KB. It appears to be a random implementation of the game of life, with various functions and logic for simulating the evolution of cells on a grid. The code includes functions for initializing the grid, updating the grid based on the rules of the game, and rendering the grid. It also includes helper functions for counting the number of live neighbors for each cell and checking if a cell is alive or dead. Overall, this file seems to be a self-contained implementation of the game of life in TypeScript.\n            </p><p>\n                153 Points |  <a href=\"https://news.ycombinator.com/item?id=37438028\">38 comments</a>\n            </p>",
            "url": "https://github.com/RuyiLi/cursed-typescript/blob/master/random/game-of-life.ts",
            "title": "Show HN: Conway's Game of Life in TypeScript's type system (github.com)",
            "summary": "TypeScript code for a game of life simulation",
            "date_modified": "2023-09-08T19:11:47.000Z",
            "author": {
                "name": "github.com"
            }
        },
        {
            "id": "https://ecl.common-lisp.dev/posts/ECL-2399-release.html",
            "content_html": "<p>The ECL developers have announced the release of ECL 23.9.9, a stable version of Embeddable Common-Lisp. This release includes bug fixes, new features, improvements to the compiler, and better conformance to the ANSI standard. Notable changes include an overhaul of thread synchronization primitives, better unicode support, and preliminary support for the Emscripten target. The release is available for download as a source code archive.\n            </p><p>\n                5 Points |  <a href=\"https://news.ycombinator.com/item?id=37442649\">0 comments</a>\n            </p>",
            "url": "https://ecl.common-lisp.dev/posts/ECL-2399-release.html",
            "title": "Embeddable Common Lisp 23.9.9 (ecl.common-lisp.dev)",
            "summary": "'Embeddable Common-Lisp 23.9.9 Released with Bug Fixes and New Features'",
            "date_modified": "2023-09-09T05:56:03.000Z",
            "author": {
                "name": "ecl.common-lisp.dev"
            }
        },
        {
            "id": "https://arstechnica.com/tech-policy/2023/09/ftc-judge-rules-intuit-broke-law-must-stop-advertising-turbotax-as-free/",
            "content_html": "<p>Intuit, the company behind TurboTax, has been ruled by a Federal Trade Commission (FTC) judge to have violated US law with deceptive advertising. The judge stated that Intuit must stop promoting TurboTax as 'free' unless all conditions of the free offer are clearly displayed to consumers. Intuit plans to appeal the decision and criticized the FTC's 'predetermined decision.' The ruling comes after the FTC filed an administrative complaint against Intuit in March 2022. If the ruling survives appeal, the order will be in effect for 20 years. Intuit has already agreed to pay $141 million in restitution to consumers in a separate case involving all 50 US states and the District of Columbia.\n            </p><p>\n                113 Points |  <a href=\"https://news.ycombinator.com/item?id=37441982\">11 comments</a>\n            </p>",
            "url": "https://arstechnica.com/tech-policy/2023/09/ftc-judge-rules-intuit-broke-law-must-stop-advertising-turbotax-as-free/",
            "title": "FTC judge rules Intuit broke law, must stop advertising TurboTax as “free” (arstechnica.com)",
            "summary": "FTC Judge Rules Intuit Must Stop Advertising TurboTax as 'Free'",
            "date_modified": "2023-09-09T03:26:37.000Z",
            "author": {
                "name": "arstechnica.com"
            }
        },
        {
            "id": "https://news.ycombinator.com/item?id=37441168",
            "content_html": "<p>No summary available\n            </p><p>\n                1 Points |  <a href=\"https://news.ycombinator.com/item?id=37441168\">0 comments</a>\n            </p>",
            "url": "https://news.ycombinator.com/item?id=37441168",
            "title": "Generally Intelligent (YC S17) is hiring technical interviewers (news.ycombinator.com)",
            "date_modified": "2023-09-09T01:02:29.000Z",
            "author": {
                "name": "news.ycombinator.com"
            }
        },
        {
            "id": "https://arxiv.org/abs/2309.00149",
            "content_html": "<p>TurboGP is a Python-based Genetic Programming (GP) library designed for machine learning tasks. It offers modern features not found in other GP implementations, such as island and cellular population schemes, various genetic operations, and online learning. One of TurboGP's unique features is its support for different types of GP nodes, allowing for different abstraction levels and making it suitable for processing diverse data sources. The library is particularly useful for neural and evolutionary computing and machine learning. The paper provides the arXiv identifier and DOI for further reference.\n            </p><p>\n                14 Points |  <a href=\"https://news.ycombinator.com/item?id=37418528\">2 comments</a>\n            </p>",
            "url": "https://arxiv.org/abs/2309.00149",
            "title": "TurboGP: A flexible and advanced Python based GP library (arxiv.org)",
            "summary": "TurboGP: A Flexible and Advanced Python-Based GP Library",
            "date_modified": "2023-09-07T13:21:17.000Z",
            "author": {
                "name": "arxiv.org"
            }
        },
        {
            "id": "https://bitbashing.io/async-rust.html",
            "content_html": "<p>The article discusses the challenges and limitations of using async Rust for concurrency. It explains the difference between parallelism and concurrency and how breaking a problem into separate, independent parts can improve performance. The author highlights the drawbacks of using threads and mutex-based concurrency, such as race conditions and deadlocks. They introduce the concept of channels as a synchronization mechanism and discuss how many modern languages provide channels in their standard libraries. The article then delves into the complexities of async Rust, including the tension between low-level control and the need for dynamic lifetimes. It concludes by suggesting that Rust may not be the best tool for massively concurrent, userspace software.\n            </p><p>\n                581 Points |  <a href=\"https://news.ycombinator.com/item?id=37435515\">480 comments</a>\n            </p>",
            "url": "https://bitbashing.io/async-rust.html",
            "title": "Maybe Rust isn’t a good tool for massively concurrent, userspace software (bitbashing.io)",
            "summary": "The Challenges of Using Async Rust for Concurrency",
            "date_modified": "2023-09-08T16:10:55.000Z",
            "author": {
                "name": "bitbashing.io"
            }
        },
        {
            "id": "https://www.ineteconomics.org/perspectives/blog/losing-out-in-critical-technologies-cisco-systems-and-financialization",
            "content_html": "<p>Cisco Systems, once a global leader in telecommunication systems and the Internet, has fallen behind global competitors in critical technologies such as 5G and Internet of Things (IoT). This is due to the company's shift from innovation to financialization, prioritizing stock buybacks to boost its stock price instead of investing in cutting-edge communication-infrastructure products. Since 2001, Cisco has spent $152.3 billion on stock buybacks, wasting funds that could have been used for innovation. The company's turn from innovation to financialization has implications for the competitive position of the US information-and-communication-technology industry. This article provides an in-depth analysis of Cisco's organizational failure and its impact on the US technology industry.\n            </p><p>\n                35 Points |  <a href=\"https://news.ycombinator.com/item?id=37415456\">28 comments</a>\n            </p>",
            "url": "https://www.ineteconomics.org/perspectives/blog/losing-out-in-critical-technologies-cisco-systems-and-financialization",
            "title": "Cisco Systems and Financialization (www.ineteconomics.org)",
            "summary": "Cisco Systems' Financialization and its Impact on the US Technology Industry",
            "date_modified": "2023-09-07T06:34:22.000Z",
            "author": {
                "name": "www.ineteconomics.org"
            }
        },
        {
            "id": "https://quuxplusone.github.io/blog/2023/09/08/constexpr-string-firewall/",
            "content_html": "<p>C++20's std::string and std::vector can be marked as constexpr, allowing them to be used in compile-time programming. However, there are two constraints on constexprness: the value cannot depend on any runtime input, and certain data cannot flow from compile-time into runtime. The article explains these constraints in detail and provides examples. It also discusses the subtleties of using string and vector in constexpr, such as the impact of small string optimization (SSO) and pointers to self. The article concludes that while constexpr string and vector can be used, it is generally recommended to use them as local variables or return types of constexpr or consteval functions rather than as constexpr or constinit variables.\n            </p><p>\n                101 Points |  <a href=\"https://news.ycombinator.com/item?id=37431425\">73 comments</a>\n            </p>",
            "url": "https://quuxplusone.github.io/blog/2023/09/08/constexpr-string-firewall/",
            "title": "Just how constexpr is C++20’s std:string? (quuxplusone.github.io)",
            "summary": "Understanding the Constraints of C++20's constexpr std::string and std::vector",
            "date_modified": "2023-09-08T09:23:27.000Z",
            "author": {
                "name": "quuxplusone.github.io"
            }
        },
        {
            "id": "https://www.abc.net.au/news/2023-09-09/wildfires-portugal-greece-california-hawaii-euclyptus-trees/102760264",
            "content_html": "<p>The Role of Australia's Eucalyptus Tree in Global Wildfires\n            </p><p>\n                10 Points |  <a href=\"https://news.ycombinator.com/item?id=37442671\">1 comments</a>\n            </p>",
            "url": "https://www.abc.net.au/news/2023-09-09/wildfires-portugal-greece-california-hawaii-euclyptus-trees/102760264",
            "title": "As wildfires burn across the world, what is the role of Australia's eucalyptus? (www.abc.net.au)",
            "summary": "The Impact of Australia's Eucalyptus Tree on Global Wildfires",
            "date_modified": "2023-09-09T06:00:57.000Z",
            "author": {
                "name": "www.abc.net.au"
            }
        },
        {
            "id": "https://github.com/JHRobotics/softgpu",
            "content_html": "<p>SoftGPU is a compilation of four projects that provide software and hardware accelerated drivers for Windows 9x virtual machines. It requires a virtual machine with VGA adapter support and Windows 95/98/Me as the guest system. The compilation includes the necessary DirectX versions, Visual C runtime, and OpenGL 95. SoftGPU offers three render drivers: softpipe, llvmlipe, and SVGA3D. The performance of these renderers varies, with SVGA3D providing the highest expected FPS. The hypervisor translation to real hardware GPU is also discussed. The installation process and system requirements are outlined, along with instructions for setting up a VirtualBox VM with hardware acceleration. The article concludes with information on running DirectX tests and optimizing performance for newer CPUs.\n            </p><p>\n                33 Points |  <a href=\"https://news.ycombinator.com/item?id=37440392\">1 comments</a>\n            </p>",
            "url": "https://github.com/JHRobotics/softgpu",
            "title": "SoftGPU: SW and HW accelerated driver for Windows 9x Virtual Machines (github.com)",
            "summary": "SoftGPU: Software and Hardware Accelerated Drivers for Windows 9x Virtual Machines",
            "date_modified": "2023-09-08T23:06:30.000Z",
            "author": {
                "name": "github.com"
            }
        },
        {
            "id": "https://www.tomshardware.com/news/cerabyte-ceramic-storage-poised-to-usher-in-yottabyte-era",
            "content_html": "<p>Cerabyte, a German storage startup, claims that its ceramic nanolayer-based storage technology will disrupt the storage market by reducing data center storage TCO by 75%. The company plans to introduce CeraMemory cartridges (2025-30) with storage capacities between 10 PB and 100 PB, and CeraTape (2030-35) with up to 1 EB capacity per tape. Cerabyte's technology uses inorganic nanolayers to store information and can read and write data at GB/s class speeds. The company also touts the durability and longevity of its ceramic storage, claiming that it can last over 5,000 years and withstand extreme temperatures and environments. Cerabyte's presentation at the 2023 Storage Developer Conference is highly anticipated.\n            </p><p>\n                128 Points |  <a href=\"https://news.ycombinator.com/item?id=37436092\">62 comments</a>\n            </p>",
            "url": "https://www.tomshardware.com/news/cerabyte-ceramic-storage-poised-to-usher-in-yottabyte-era",
            "title": "Cerabyte: ceramic storage poised to usher in 'yottabyte era' (www.tomshardware.com)",
            "summary": "Cerabyte's Ceramic Storage Technology Poised to Disrupt the Market",
            "date_modified": "2023-09-08T16:49:59.000Z",
            "author": {
                "name": "www.tomshardware.com"
            }
        },
        {
            "id": "http://touchpianist.com/",
            "content_html": "<p>This is a brief description of a mobile app called 'More Pieces!' that is available for free on Android and iOS. The app allows users to choose different pieces and explore touch expression. The summary mentions that there is more information available about the app, including details about its creator and a press kit. The content is truncated, so it is unclear what specific features or functionality the app offers. However, the summary emphasizes that it is available on both Android and iOS platforms.\n            </p><p>\n                699 Points |  <a href=\"https://news.ycombinator.com/item?id=37431644\">200 comments</a>\n            </p>",
            "url": "http://touchpianist.com/",
            "title": "Touch Pianist (touchpianist.com)",
            "summary": "'More Pieces!': A Free Mobile App for Exploring Touch Expression",
            "date_modified": "2023-09-08T09:56:08.000Z",
            "author": {
                "name": "touchpianist.com"
            }
        },
        {
            "id": "https://www.science.org/doi/10.1126/scitranslmed.abq3916",
            "content_html": "<p>The website www.science.org is requesting to review the security of your connection before proceeding. This is likely due to concerns about the safety of your data and information. The site is using Cloudflare for performance and security purposes. It is important to ensure that your connection is secure before continuing to browse the website.\n            </p><p>\n                21 Points |  <a href=\"https://news.ycombinator.com/item?id=37412738\">3 comments</a>\n            </p>",
            "url": "https://www.science.org/doi/10.1126/scitranslmed.abq3916",
            "title": "Delivery of gene therapy through CSF conduit to rescue hearing in adult mice (www.science.org)",
            "summary": "Security Review Requested for www.science.org",
            "date_modified": "2023-09-06T23:21:52.000Z",
            "author": {
                "name": "www.science.org"
            }
        },
        {
            "id": "https://mtlynch.io/aardvarkd/",
            "content_html": "<p>Aardvark'd: The Fog Creek Documentary, 18 Years Later is a documentary film that captures interviews with individuals who went on to achieve fame and success in the tech industry. It explores the indie software scene in 2005, featuring Fog Creek Software, Y Combinator, and the launch of reddit. The film showcases the vulnerability and uncertainty experienced by tech startup founders in their early days. Despite its flaws, the documentary effectively captures the anxiety and anticipation surrounding the launch of a software product. The article also reveals surprising details, such as the fact that Fog Creek did not finance the documentary and the subsequent fate of the interns featured in the film.\n            </p><p>\n                427 Points |  <a href=\"https://news.ycombinator.com/item?id=37433186\">138 comments</a>\n            </p>",
            "url": "https://mtlynch.io/aardvarkd/",
            "title": "Aardvark'd: The Fog Creek documentary, 18 years later (mtlynch.io)",
            "summary": "Aardvark'd: The Fog Creek Documentary Explores Tech Startup Founders' Vulnerability and Uncertainty",
            "date_modified": "2023-09-08T13:26:45.000Z",
            "author": {
                "name": "mtlynch.io"
            }
        },
        {
            "id": "https://archiveprogram.github.com/arctic-vault/",
            "content_html": "<p>GitHub has created the Arctic Code Vault, a data repository stored in the Arctic World Archive (AWA) to preserve a snapshot of every active public repository as of 02/02/2020. The AWA is located in a decommissioned coal mine in the Svalbard archipelago, known for its stability and remoteness. The archive is expected to last 1,000 years due to the permafrost and the mine's proximity to the Global Seed Vault. The 02/02/2020 snapshot, consisting of 21TB of data, was stored on 186 reels of film and transported to the Arctic Code Vault. To recognize contributors, GitHub designed the Arctic Code Vault Badge displayed on developers' profiles.\n            </p><p>\n                37 Points |  <a href=\"https://news.ycombinator.com/item?id=37429645\">25 comments</a>\n            </p>",
            "url": "https://archiveprogram.github.com/arctic-vault/",
            "title": "Arctic Code Vault (archiveprogram.github.com)",
            "summary": "GitHub Creates Arctic Code Vault to Preserve Public Repositories",
            "date_modified": "2023-09-08T05:16:57.000Z",
            "author": {
                "name": "archiveprogram.github.com"
            }
        }
    ]
}