{
    "version": "https://jsonfeed.org/version/1",
    "title": "Hacker News Summary",
    "home_page_url": "https://ruanyf.github.io/hnsummary",
    "feed_url": "https://ruanyf.github.io/hnsummary/rss.json",
    "description": "HN posts' summary",
    "icon": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b2/Y_Combinator_logo.svg/500px-Y_Combinator_logo.svg.png",
    "author": {
        "name": "Ruan Yifeng",
        "url": "https://www.ruanyifeng.com/blog"
    },
    "items": [
        {
            "id": "https://discourse.julialang.org/t/julia-mojo-mandelbrot-benchmark/103638",
            "content_html": "<p>Julia code for calculating the Mandelbrot set is benchmarked against Mojo code. The Julia code takes 7.45 ms, while the Mojo code runs in 2.14 ms. Suggestions are made to improve the Julia code, including using SIMD vectorization and decomposing complex numbers. The @simd macro is limited and cannot see through function calls. Differences between the Julia and Mojo code, such as the use of FP ranges, may also affect performance. Overall, the goal is to optimize the Julia code and potentially surpass the performance of the Mojo code.\n            </p><p>\n                31 Points |  <a href=\"https://news.ycombinator.com/item?id=37442064\">3 comments</a>\n            </p>",
            "url": "https://discourse.julialang.org/t/julia-mojo-mandelbrot-benchmark/103638",
            "title": "Julia and Mojo (Modular) Mandelbrot Benchmark (discourse.julialang.org)",
            "summary": "Benchmarking Julia and Mojo Mandelbrot Code",
            "date_modified": "2023-09-09T03:42:53.000Z",
            "author": {
                "name": "discourse.julialang.org"
            }
        },
        {
            "id": "https://www.theguardian.com/science/2023/sep/07/nishimura-comet-could-be-visible-to-naked-eye-this-weekend",
            "content_html": "<p>Comet Nishimura, discovered just a month ago, could be visible to the naked eye this weekend, offering stargazers a rare opportunity to observe it. Most comets are discovered months or years before reaching peak visibility, but Nishimura is an exception. It swings by the sun only every 437 years, spending most of its time in the outer solar system. The comet will pass closest to the sun on September 17th and will be easiest to observe in the northern hemisphere this Saturday and Sunday. Stargazers can look towards the north-eastern sky before sunrise, to the left of Venus, for the best view.\n            </p><p>\n                12 Points |  <a href=\"https://news.ycombinator.com/item?id=37413387\">0 comments</a>\n            </p>",
            "url": "https://www.theguardian.com/science/2023/sep/07/nishimura-comet-could-be-visible-to-naked-eye-this-weekend",
            "title": "Newly discovered comet Nishimura could be visible to naked eye this weekend (www.theguardian.com)",
            "summary": "Newly Discovered Comet Nishimura Could Be Visible to Naked Eye This Weekend",
            "date_modified": "2023-09-07T00:48:16.000Z",
            "author": {
                "name": "www.theguardian.com"
            }
        },
        {
            "id": "https://maizure.org/projects/decoded-gnu-coreutils/",
            "content_html": "<p>Decoding the GNU coreutils version 8.3 is a long-term project aimed at providing useful background for novice programmers exploring the design of command-line utilities. The project is divided into phases, with Phase 1 and Phase 2 already complete. Phase 1 focused on discussing the namespace and execution overview of each utility, while Phase 2 expanded on important design decisions and algorithms. The project also aims to provide a line-by-line code walkthrough for each utility in the future. The GNU coreutils, which are small, single-source file programs, have their own unique design patterns and often rely on the Getopt toolset for parsing command line options. The utilities also make use of the fts library for traversing the file system and include syscall wrappers and helpers from the Gnulib project. Overall, the project provides helpful insights into the design and implementation of the GNU coreutils.\n            </p><p>\n                158 Points |  <a href=\"https://news.ycombinator.com/item?id=37439535\">46 comments</a>\n            </p>",
            "url": "https://maizure.org/projects/decoded-gnu-coreutils/",
            "title": "Decoded: GNU Coreutils (2018) (maizure.org)",
            "summary": "Decoding the GNU coreutils: Exploring the Design of Command-Line Utilities",
            "date_modified": "2023-09-08T21:15:52.000Z",
            "author": {
                "name": "maizure.org"
            }
        },
        {
            "id": "https://msprout.notion.site/LogoScale-A-Method-for-Vectorizing-Small-Crappy-Logos-dc0035b7473c44f8b94ffc4026d286c0",
            "content_html": "<p>N/A\n            </p><p>\n                94 Points |  <a href=\"https://news.ycombinator.com/item?id=37440631\">10 comments</a>\n            </p>",
            "url": "https://msprout.notion.site/LogoScale-A-Method-for-Vectorizing-Small-Crappy-Logos-dc0035b7473c44f8b94ffc4026d286c0",
            "title": "LogoScale – A method for vectorizing small, crappy logos (msprout.notion.site)",
            "summary": "N/A",
            "date_modified": "2023-09-08T23:38:39.000Z",
            "author": {
                "name": "msprout.notion.site"
            }
        },
        {
            "id": "https://blog.dataparty.xyz/blog/snoop-unto-them/",
            "content_html": "<p>DEFCON 31 has released official videos of their talks, including 'Snoop unto them as they snoop unto you'. The talk, slides, files, and code are available for download. The blog post also provides links to support the speakers through buying them a coffee, getting their product rfparty, and following them on various social media platforms. The post ends with an invitation to join their Discord server and sign up for their mailing list.\n            </p><p>\n                127 Points |  <a href=\"https://news.ycombinator.com/item?id=37440104\">75 comments</a>\n            </p>",
            "url": "https://blog.dataparty.xyz/blog/snoop-unto-them/",
            "title": "Snoop unto them as they snoop unto you (blog.dataparty.xyz)",
            "summary": "DEFCON 31 Releases Official Videos and Offers Support Options",
            "date_modified": "2023-09-08T22:26:51.000Z",
            "author": {
                "name": "blog.dataparty.xyz"
            }
        },
        {
            "id": "https://www.science.org/content/article/most-bees-live-underground-x-ray-images-reveal-how-they-build-their-nests",
            "content_html": "<p>The website www.science.org is checking the security of your connection before allowing access. This is likely due to the use of Cloudflare for performance and security. The Ray ID provided is 803b4673adb9ce94. It is important for websites to ensure secure connections to protect user data. The review process is necessary to prevent unauthorized access or data breaches. Once the security check is completed, users will be able to proceed to the website.\n            </p><p>\n                66 Points |  <a href=\"https://news.ycombinator.com/item?id=37440482\">10 comments</a>\n            </p>",
            "url": "https://www.science.org/content/article/most-bees-live-underground-x-ray-images-reveal-how-they-build-their-nests",
            "title": "Morphology and temporal evolution of ground-nesting bee burrows (www.science.org)",
            "summary": "Security Check Required for Access to www.science.org",
            "date_modified": "2023-09-08T23:17:21.000Z",
            "author": {
                "name": "www.science.org"
            }
        },
        {
            "id": "https://today.ucsd.edu/story/forwarding_based_spoofing",
            "content_html": "<p>Researchers at the University of California San Diego have discovered security flaws in the email forwarding process that allow scammers to impersonate high-profile domains. This vulnerability affects tens of thousands of domains, including government organizations, financial service companies, and major news organizations. The researchers found that scammers can send spoofed emails that bypass the safeguards of email providers like Gmail and Outlook, increasing the likelihood of recipients opening malicious attachments or clicking on harmful links. The vulnerabilities arise from the delegation of email infrastructure to third-party providers and the assumption that each organization operates its own mailing infrastructure. While some providers have patched the issues, the researchers recommend disabling open forwarding and implementing stricter validation policies to address the root problem.\n            </p><p>\n                148 Points |  <a href=\"https://news.ycombinator.com/item?id=37438478\">41 comments</a>\n            </p>",
            "url": "https://today.ucsd.edu/story/forwarding_based_spoofing",
            "title": "Scammers can exploit email forwarding flaws to impersonate high-profile domains (today.ucsd.edu)",
            "summary": "Security Flaws in Email Forwarding Allow Scammers to Impersonate High-profile Domains",
            "date_modified": "2023-09-08T19:45:08.000Z",
            "author": {
                "name": "today.ucsd.edu"
            }
        },
        {
            "id": "https://github.com/dancrossnyc/rxv64",
            "content_html": "<p>rxv64 is a pedagogical operating system written in Rust that targets multiprocessor x86_64 machines. It is a reimplementation of the xv6 operating system from MIT. The system supports limited hardware including the text-mode CGA device, serial port, PS/2 keyboard controller, and PCIe AHCI SATA storage devices. The xv6 README provides more information on its origin and intended use.\n            </p><p>\n                86 Points |  <a href=\"https://news.ycombinator.com/item?id=37439391\">14 comments</a>\n            </p>",
            "url": "https://github.com/dancrossnyc/rxv64",
            "title": "The rxv64 Operating System: MIT's xv6, in Rust, for SMP x86_64 machines (github.com)",
            "summary": "rxv64: A Pedagogical Operating System Reimplementation of xv6 in Rust",
            "date_modified": "2023-09-08T21:03:19.000Z",
            "author": {
                "name": "github.com"
            }
        },
        {
            "id": "https://material.io/blog/2023-google-fonts-redesign",
            "content_html": "<p>Google Fonts has redesigned its website to provide better ways of exploring and finding fonts and icons. The updates include a new site navigation using Material 3 Navigation Rail, an improved mobile experience with a bottom navigation bar, and a new sidebar for searching and filtering fonts and icons. The layout also introduces a new color palette for light and dark mode. Users can try out the new experience on fonts.google.com and provide feedback. Overall, the redesign aims to enhance the user experience and make it easier to find the right assets for projects.\n            </p><p>\n                12 Points |  <a href=\"https://news.ycombinator.com/item?id=37441683\">4 comments</a>\n            </p>",
            "url": "https://material.io/blog/2023-google-fonts-redesign",
            "title": "The new Google Fonts: find what you’re looking for (material.io)",
            "summary": "Google Fonts Redesigns Website to Improve Font and Icon Search",
            "date_modified": "2023-09-09T02:38:22.000Z",
            "author": {
                "name": "material.io"
            }
        },
        {
            "id": "https://github.com/RuyiLi/cursed-typescript/blob/master/random/game-of-life.ts",
            "content_html": "<p>This is a code file for a TypeScript implementation of the Game of Life. The code consists of 203 lines and is approximately 7.24 KB in size. It appears to be a random file within a larger project called 'cursed-typescript'.\n            </p><p>\n                113 Points |  <a href=\"https://news.ycombinator.com/item?id=37438028\">31 comments</a>\n            </p>",
            "url": "https://github.com/RuyiLi/cursed-typescript/blob/master/random/game-of-life.ts",
            "title": "Show HN: Conway's Game of Life in TypeScript's type system (github.com)",
            "summary": "Code File for TypeScript Implementation of Game of Life",
            "date_modified": "2023-09-08T19:11:47.000Z",
            "author": {
                "name": "github.com"
            }
        },
        {
            "id": "https://rafalcieslak.wordpress.com/2013/04/02/dynamic-linker-tricks-using-ld_preload-to-cheat-inject-features-and-investigate-programs/",
            "content_html": "<p>Using LD_PRELOAD to manipulate the behavior of applications\n            </p><p>\n                111 Points |  <a href=\"https://news.ycombinator.com/item?id=37439125\">63 comments</a>\n            </p>",
            "url": "https://rafalcieslak.wordpress.com/2013/04/02/dynamic-linker-tricks-using-ld_preload-to-cheat-inject-features-and-investigate-programs/",
            "title": "Using LD_PRELOAD to cheat, inject features and investigate programs (rafalcieslak.wordpress.com)",
            "summary": "Manipulating Application Behavior with LD_PRELOAD",
            "date_modified": "2023-09-08T20:41:20.000Z",
            "author": {
                "name": "rafalcieslak.wordpress.com"
            }
        },
        {
            "id": "https://twitter.com/typesfast/status/1700092765798048093",
            "content_html": "<p>Twitter no longer supports this browser and users are advised to switch to a supported browser in order to continue using the platform. The Help Center provides a list of supported browsers for reference. The message also includes links to the Terms of Service, Privacy Policy, Cookie Policy, and Imprint. The copyright information indicates that it is © 2023 X Corp.\n            </p><p>\n                302 Points |  <a href=\"https://news.ycombinator.com/item?id=37433681\">392 comments</a>\n            </p>",
            "url": "https://twitter.com/typesfast/status/1700092765798048093",
            "title": "Flexport is rescinding a bunch of signed offer letters (twitter.com)",
            "summary": "Twitter Requires Switch to Supported Browser",
            "date_modified": "2023-09-08T14:07:55.000Z",
            "author": {
                "name": "twitter.com"
            }
        },
        {
            "id": "https://github.com/oven-sh/bun/releases/tag/bun-v1.0.0",
            "content_html": "<p>Bun v1.0 is now available for installation and upgrade. The release notes highlight various bug fixes and improvements, including fixes for sourcemaps, hot reloading, module imports, debugger support, and more. The release also brings in uSockets and uWebSockets forks into Bun's repository. The changelog lists all the changes made from version 0.8.1 to 1.0.0. The release has seen contributions from new contributors as well. Overall, Bun v1.0 offers several enhancements and bug fixes for a better development experience.\n            </p><p>\n                810 Points |  <a href=\"https://news.ycombinator.com/item?id=37434117\">277 comments</a>\n            </p>",
            "url": "https://github.com/oven-sh/bun/releases/tag/bun-v1.0.0",
            "title": "Bun v1.0.0 (github.com)",
            "summary": "Bun v1.0 Release: Bug Fixes, Improvements, and New Features",
            "date_modified": "2023-09-08T14:41:03.000Z",
            "author": {
                "name": "github.com"
            }
        },
        {
            "id": "https://news.ycombinator.com/item?id=37441168",
            "content_html": "<p>No summary available\n            </p><p>\n                1 Points |  <a href=\"https://news.ycombinator.com/item?id=37441168\">0 comments</a>\n            </p>",
            "url": "https://news.ycombinator.com/item?id=37441168",
            "title": "Generally Intelligent (YC S17) is hiring technical interviewers (news.ycombinator.com)",
            "date_modified": "2023-09-09T01:02:29.000Z",
            "author": {
                "name": "news.ycombinator.com"
            }
        },
        {
            "id": "https://www.ineteconomics.org/perspectives/blog/losing-out-in-critical-technologies-cisco-systems-and-financialization",
            "content_html": "<p>Cisco Systems, once a global leader in telecommunication systems and the Internet, has fallen behind global competitors in critical technologies such as 5G and IoT. This is due to the company's shift from innovation to financialization, prioritizing stock buybacks over investments in cutting-edge communication-infrastructure products. Since 2001, Cisco has spent $152.3 billion on stock buybacks, wasting funds that could have been used for technological advancements. The company's focus on maximizing shareholder value has hindered its competitive position in the US information-and-communication-technology industry. This article explores Cisco's transformation from an innovative enterprise to a financialized one and discusses the implications for the industry's global competitiveness.\n            </p><p>\n                28 Points |  <a href=\"https://news.ycombinator.com/item?id=37415456\">13 comments</a>\n            </p>",
            "url": "https://www.ineteconomics.org/perspectives/blog/losing-out-in-critical-technologies-cisco-systems-and-financialization",
            "title": "Cisco Systems and Financialization (www.ineteconomics.org)",
            "summary": "Cisco Systems' Financialization and its Impact on US Technology Competitiveness",
            "date_modified": "2023-09-07T06:34:22.000Z",
            "author": {
                "name": "www.ineteconomics.org"
            }
        },
        {
            "id": "https://quuxplusone.github.io/blog/2023/09/08/constexpr-string-firewall/",
            "content_html": "<p>C++20's std::string and std::vector can be marked as constexpr, allowing them to be used in compile-time programming. However, there are two constraints on constexprness: the value cannot depend on runtime input, and certain data cannot flow from compile-time into runtime. The article explains these constraints using examples of stack variables and memory addresses. It also discusses the limitations of constexpr string and vector, such as the inability to escape pointers to their data and the impact of small string optimization (SSO). The intended use of constexpr string and vector is as local variables or return types of constexpr or consteval functions, rather than as constexpr or constinit variables.\n            </p><p>\n                94 Points |  <a href=\"https://news.ycombinator.com/item?id=37431425\">70 comments</a>\n            </p>",
            "url": "https://quuxplusone.github.io/blog/2023/09/08/constexpr-string-firewall/",
            "title": "Just how constexpr is C++20’s std:string? (quuxplusone.github.io)",
            "summary": "Understanding the constexprness of C++20's std::string",
            "date_modified": "2023-09-08T09:23:27.000Z",
            "author": {
                "name": "quuxplusone.github.io"
            }
        },
        {
            "id": "https://bitbashing.io/async-rust.html",
            "content_html": "<p>The article discusses the challenges and limitations of using async Rust for concurrency. It explains the difference between parallelism and concurrency and how breaking a problem into separate, independent parts can improve performance. The author explores the use of threads and mutex-based concurrency, highlighting the drawbacks and complexities involved. They then introduce the concept of channels as a synchronization mechanism and discuss how many modern languages, including Rust, provide channels in their standard libraries. The article also delves into the unique challenges of async Rust, such as the need to assure the compiler of data safety and the limitations of using Arc for dynamic lifetimes. Overall, the author suggests that while Rust may not be the best tool for massively concurrent, userspace software, it can still be valuable for other projects.\n            </p><p>\n                500 Points |  <a href=\"https://news.ycombinator.com/item?id=37435515\">418 comments</a>\n            </p>",
            "url": "https://bitbashing.io/async-rust.html",
            "title": "Maybe Rust isn’t a good tool for massively concurrent, userspace software (bitbashing.io)",
            "summary": "Challenges and Limitations of Async Rust for Concurrency",
            "date_modified": "2023-09-08T16:10:55.000Z",
            "author": {
                "name": "bitbashing.io"
            }
        },
        {
            "id": "https://peterme.net/teaching-old-c-code-new-tricks-with-nim.html",
            "content_html": "<p>Teaching old C code new tricks with Nim\n            </p><p>\n                5 Points |  <a href=\"https://news.ycombinator.com/item?id=37441829\">0 comments</a>\n            </p>",
            "url": "https://peterme.net/teaching-old-c-code-new-tricks-with-nim.html",
            "title": "Teaching old C code new tricks with Nim (peterme.net)",
            "summary": "Using Nim to Improve Error Handling in C Code",
            "date_modified": "2023-09-09T03:01:29.000Z",
            "author": {
                "name": "peterme.net"
            }
        },
        {
            "id": "https://arxiv.org/abs/2309.00149",
            "content_html": "<p>TurboGP is a Python-based Genetic Programming (GP) library designed for machine learning tasks. It offers modern features not found in other GP implementations, including island and cellular population schemes, various genetic operations, and online learning. One of TurboGP's unique features is its support for different types of GP nodes, allowing for different abstraction levels and making it useful for processing diverse data sources. The paper provides a brief overview of TurboGP's capabilities and highlights its potential applications in neural and evolutionary computing and machine learning. The library's flexibility and advanced features make it a valuable tool for researchers and practitioners in the field.\n            </p><p>\n                3 Points |  <a href=\"https://news.ycombinator.com/item?id=37418528\">0 comments</a>\n            </p>",
            "url": "https://arxiv.org/abs/2309.00149",
            "title": "TurboGP: A flexible and advanced Python based GP library (arxiv.org)",
            "summary": "TurboGP: A Flexible and Advanced Python-Based GP Library",
            "date_modified": "2023-09-07T13:21:17.000Z",
            "author": {
                "name": "arxiv.org"
            }
        },
        {
            "id": "https://arstechnica.com/tech-policy/2023/09/ftc-judge-rules-intuit-broke-law-must-stop-advertising-turbotax-as-free/",
            "content_html": "<p>Intuit has been ruled by the Federal Trade Commission's chief administrative law judge to have violated US law with deceptive advertising for TurboTax. The judge ordered Intuit to stop promoting TurboTax as 'free' unless all conditions of the free offer are clearly displayed to consumers. Intuit plans to appeal the decision and criticized the judge's ruling as being in favor of the FTC's own lawsuit. The ruling stated that Intuit engaged in deceptive advertising by falsely claiming that consumers could file their taxes online for free using TurboTax. If the ruling survives appeal, it will be in effect for 20 years.\n            </p><p>\n                16 Points |  <a href=\"https://news.ycombinator.com/item?id=37441982\">1 comments</a>\n            </p>",
            "url": "https://arstechnica.com/tech-policy/2023/09/ftc-judge-rules-intuit-broke-law-must-stop-advertising-turbotax-as-free/",
            "title": "FTC judge rules Intuit broke law, must stop advertising TurboTax as “free” (arstechnica.com)",
            "summary": "FTC Judge Rules Intuit Must Stop Advertising TurboTax as 'Free'",
            "date_modified": "2023-09-09T03:26:37.000Z",
            "author": {
                "name": "arstechnica.com"
            }
        },
        {
            "id": "https://www.newyorker.com/culture/personal-history/the-power-of-food-for-people-with-dementia",
            "content_html": "<p>The Power of Food for People with Dementia explores the potential benefits of using food to trigger memories and improve the quality of life for individuals with dementia. The article shares personal experiences of the author's father's decline due to dementia and highlights the moments of joy and connection that food brought to him. It discusses a unique event called the Dinner Party, organized by a playwright and actor in collaboration with the Global Brain Health Institute, where individuals with cognitive impairment share stories of their favorite foods and then recreate and enjoy those dishes. The article also touches on the therapeutic effects of creative activities and musical memory for dementia patients. Overall, the Dinner Party aims to explore the power of food in enhancing neuroplasticity and improving the lives of individuals with dementia.\n            </p><p>\n                5 Points |  <a href=\"https://news.ycombinator.com/item?id=37413566\">0 comments</a>\n            </p>",
            "url": "https://www.newyorker.com/culture/personal-history/the-power-of-food-for-people-with-dementia",
            "title": "The Power of Food for People with Dementia (www.newyorker.com)",
            "summary": "The Power of Food for People with Dementia",
            "date_modified": "2023-09-07T01:15:10.000Z",
            "author": {
                "name": "www.newyorker.com"
            }
        },
        {
            "id": "https://www.tomshardware.com/news/cerabyte-ceramic-storage-poised-to-usher-in-yottabyte-era",
            "content_html": "<p>Cerabyte, a German storage startup, claims that its ceramic nanolayer-based storage technology will disrupt the storage market by reducing data center storage TCO by 75%. The company plans to introduce CeraMemory cartridges (2025-30) with storage capacities between 10 PB and 100 PB, and CeraTape (2030-35) with up to 1 EB capacity per tape. Cerabyte's technology uses inorganic nanolayers to store information and can read and write data at GB/s class speeds. The company also highlights the durability and longevity of its ceramic storage, claiming that it can last over 5,000 years and withstand extreme temperatures and environments. Cerabyte's presentation at the 2023 Storage Developer Conference is highly anticipated.\n            </p><p>\n                113 Points |  <a href=\"https://news.ycombinator.com/item?id=37436092\">51 comments</a>\n            </p>",
            "url": "https://www.tomshardware.com/news/cerabyte-ceramic-storage-poised-to-usher-in-yottabyte-era",
            "title": "Cerabyte: ceramic storage poised to usher in 'yottabyte era' (www.tomshardware.com)",
            "summary": "Cerabyte's Ceramic Storage Technology Aims to Revolutionize the Market",
            "date_modified": "2023-09-08T16:49:59.000Z",
            "author": {
                "name": "www.tomshardware.com"
            }
        },
        {
            "id": "https://www.science.org/doi/10.1126/scitranslmed.abq3916",
            "content_html": "<p>The website www.science.org is requesting to review the security of the user's connection before proceeding. This is likely due to concerns about potential security risks or vulnerabilities. The website is utilizing Cloudflare for performance and security purposes. The specific Ray ID provided is 803b0eb75fbdcf4d, which may be used for tracking or troubleshooting purposes. It is important for users to ensure the security of their connection before accessing the website.\n            </p><p>\n                3 Points |  <a href=\"https://news.ycombinator.com/item?id=37412738\">0 comments</a>\n            </p>",
            "url": "https://www.science.org/doi/10.1126/scitranslmed.abq3916",
            "title": "Delivery of gene therapy through CSF conduit to rescue hearing in adult mice (www.science.org)",
            "summary": "Security Review Requested for www.science.org",
            "date_modified": "2023-09-06T23:21:52.000Z",
            "author": {
                "name": "www.science.org"
            }
        },
        {
            "id": "https://github-guessr.vercel.app/",
            "content_html": "<p>N/A\n            </p><p>\n                80 Points |  <a href=\"https://news.ycombinator.com/item?id=37432067\">38 comments</a>\n            </p>",
            "url": "https://github-guessr.vercel.app/",
            "title": "GitHubGuessr (github-guessr.vercel.app)",
            "summary": "N/A",
            "date_modified": "2023-09-08T11:09:44.000Z",
            "author": {
                "name": "github-guessr.vercel.app"
            }
        },
        {
            "id": "https://archiveprogram.github.com/arctic-vault/",
            "content_html": "<p>GitHub has created the Arctic Code Vault, a data repository stored in the Arctic World Archive (AWA) to preserve a snapshot of every active public repository as of 02/02/2020. The AWA is a long-term archival facility located in a decommissioned coal mine in the Svalbard archipelago. The archive is designed to last 1,000 years and is considered a stable site for preserving humanity's collective knowledge. The 02/02/2020 snapshot, consisting of 21TB of data, was stored on 186 reels of film and transported to the Arctic Code Vault. To recognize contributions, GitHub created the Arctic Code Vault Badge displayed on developers' profiles. The vault contains open source software from millions of developers worldwide.\n            </p><p>\n                14 Points |  <a href=\"https://news.ycombinator.com/item?id=37429645\">10 comments</a>\n            </p>",
            "url": "https://archiveprogram.github.com/arctic-vault/",
            "title": "Artic Code Vault (archiveprogram.github.com)",
            "summary": "GitHub Creates Arctic Code Vault to Preserve Open Source Software",
            "date_modified": "2023-09-08T05:16:57.000Z",
            "author": {
                "name": "archiveprogram.github.com"
            }
        },
        {
            "id": "https://mtlynch.io/aardvarkd/",
            "content_html": "<p>Aardvark'd: The Fog Creek Documentary, 18 Years Later is a documentary film about Fog Creek's summer internship program in 2005. The film captures interviews with individuals who would go on to achieve fame and success in the tech industry. It explores the indie software scene of 2005, featuring Fog Creek Software, Y Combinator, and the launch of reddit. The documentary showcases the vulnerability and uncertainty experienced by tech startup founders during their early days. Despite its flaws, Aardvark'd provides a relatable and engaging look into the challenges of launching a software product. The film ends without a clear resolution, leaving viewers wondering about the outcome of the interns' project. The documentary includes insightful quotes from Paul Graham and Aaron Swartz. Surprisingly, Fog Creek did not finance the film, and the filmmaker recently uploaded it for free on YouTube.\n            </p><p>\n                370 Points |  <a href=\"https://news.ycombinator.com/item?id=37433186\">128 comments</a>\n            </p>",
            "url": "https://mtlynch.io/aardvarkd/",
            "title": "Aardvark'd: The Fog Creek documentary, 18 years later (mtlynch.io)",
            "summary": "Aardvark'd: The Fog Creek Documentary, 18 Years Later - A Look into the Early Days of Tech Startup Founders",
            "date_modified": "2023-09-08T13:26:45.000Z",
            "author": {
                "name": "mtlynch.io"
            }
        },
        {
            "id": "http://touchpianist.com/",
            "content_html": "<p>This is a brief summary of a menu or selection of pieces available on a mobile app. The menu offers the option to choose a different piece and provides information about the app and its creator. It mentions that the app is available for free on Android and iOS platforms. The content seems to be truncated, so it is difficult to provide a more detailed summary.\n            </p><p>\n                584 Points |  <a href=\"https://news.ycombinator.com/item?id=37431644\">186 comments</a>\n            </p>",
            "url": "http://touchpianist.com/",
            "title": "Touch Pianist (touchpianist.com)",
            "summary": "Menu of Pieces on a Mobile App",
            "date_modified": "2023-09-08T09:56:08.000Z",
            "author": {
                "name": "touchpianist.com"
            }
        },
        {
            "id": "https://github.com/JHRobotics/softgpu",
            "content_html": "<p>SoftGPU: SW and HW accelerated driver for Windows 9x Virtual Machines is a compilation of four projects that provide virtual machine support for VGA adapters and Windows 95/98/Me guest systems. It requires specific versions of DirectX, Visual C runtime, and OpenGL. The SoftGPU driver offers three render drivers: softpipe, llvmlipe, and SVGA3D. Each renderer has different requirements and supports various features and applications/games. The hypervisor translation to real HW GPU is also discussed. The installation process and system requirements are outlined, along with instructions for setting up a VirtualBox VM with hardware acceleration. The summary concludes with a note about performance optimization for newer CPUs.\n            </p><p>\n                11 Points |  <a href=\"https://news.ycombinator.com/item?id=37440392\">0 comments</a>\n            </p>",
            "url": "https://github.com/JHRobotics/softgpu",
            "title": "SoftGPU: SW and HW accelerated driver for Windows 9x Virtual Machines (github.com)",
            "summary": "SoftGPU: SW and HW Accelerated Driver for Windows 9x Virtual Machines",
            "date_modified": "2023-09-08T23:06:30.000Z",
            "author": {
                "name": "github.com"
            }
        },
        {
            "id": "https://www.robinsloan.com/newsletters/what-would-a-wizard-read/#walking",
            "content_html": "<p>Robin Sloan announces the upcoming publication of his new novel in June 2024 and shares his excitement. He discusses the influence of fantasy sagas on his previous novels and explores the idea of going beyond homage to actively participate in the genre. Sloan plans to create a rich introduction and companion for his new novel, incorporating various influences and media. He also reviews a novel by Michiko Aoyama and reflects on the need for creative investigations of decency and goodness. Sloan asks for nominations of great author websites and discusses the problem-solving power of walking. He concludes by highlighting the quality of science journalism and sharing an interesting logo treatment for Mattel Electronics.\n            </p><p>\n                132 Points |  <a href=\"https://news.ycombinator.com/item?id=37426107\">30 comments</a>\n            </p>",
            "url": "https://www.robinsloan.com/newsletters/what-would-a-wizard-read/#walking",
            "title": "The thinking path (www.robinsloan.com)",
            "summary": "Robin Sloan's Excitement for His New Novel and Reflections on Creativity and Goodness",
            "date_modified": "2023-09-07T21:52:02.000Z",
            "author": {
                "name": "www.robinsloan.com"
            }
        },
        {
            "id": "https://eprint.iacr.org/2023/1053",
            "content_html": "<p>ASMesh is a new protocol that provides anonymous and secure messaging in mesh networks. It addresses the limitations of centralized service providers in scenarios like mass protests in censored networks. The protocol is designed to achieve forward and post-compromise security, as well as forward and post-compromise anonymity. It builds on Signal's Double Ratchet protocol and introduces enhancements to ensure strong confidentiality and anonymity under user corruptions. The protocol's security is proven and its performance is evaluated in simulated mesh networks. The paper also includes a proof of concept implementation.\n            </p><p>\n                5 Points |  <a href=\"https://news.ycombinator.com/item?id=37431433\">0 comments</a>\n            </p>",
            "url": "https://eprint.iacr.org/2023/1053",
            "title": "ASMesh: Anonymous, Secure Messaging in Mesh Networks (eprint.iacr.org)",
            "summary": "ASMesh: Anonymous and Secure Messaging in Mesh Networks Using Stronger, Anonymous Double Ratchet",
            "date_modified": "2023-09-08T09:24:25.000Z",
            "author": {
                "name": "eprint.iacr.org"
            }
        }
    ]
}