{
    "version": "https://jsonfeed.org/version/1",
    "title": "Hacker News Summary",
    "home_page_url": "https://ruanyf.github.io/hnsummary",
    "feed_url": "https://ruanyf.github.io/hnsummary/rss.json",
    "description": "HN posts' summary",
    "icon": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b2/Y_Combinator_logo.svg/500px-Y_Combinator_logo.svg.png",
    "author": {
        "name": "Ruan Yifeng",
        "url": "https://www.ruanyifeng.com/blog"
    },
    "items": [
        {
            "id": "https://bricknerd.com/home/every-type-of-plastic-used-by-lego-5-20-22",
            "content_html": "<p>LEGO uses a variety of plastics for their bricks, including CA, HIPS, Bakelite, ABS, SAN, PP, PC, MABS, PA, POM, TP, PE, MTPO, TPU, SEBS, and PET. Each plastic has its own properties and uses, with ABS being the most commonly used since 1963. LEGO is also investing in developing sustainable materials and has already started using plant-sourced polyethylene and phasing out plastic shopping bags.\n            </p><p>\n                12 Points |  <a href=\"https://news.ycombinator.com/item?id=37444268\">0 comments</a>\n            </p>",
            "url": "https://bricknerd.com/home/every-type-of-plastic-used-by-lego-5-20-22",
            "title": "Every Type of Plastic Used by Lego (bricknerd.com)",
            "summary": "The Many Types of Plastic Used By LEGO",
            "date_modified": "2023-09-09T11:43:59.000Z",
            "author": {
                "name": "bricknerd.com"
            }
        },
        {
            "id": "https://www.moneycontrol.com/europe/?url=https://www.moneycontrol.com/news/trends/layoffs-google-microsoft-meta-amazon-hiring-low-paid-h1b-workers-after-us-layoffs-report-10605301.html",
            "content_html": "<p>Top Silicon Valley companies, including Google, Meta, Amazon, Microsoft, Zoom, Salesforce, and Palantir, have applied for thousands of H1B worker visas this year, despite carrying out mass layoffs. This comes as many workers on H1B visas, including Indians, have been affected by the layoffs in the United States. The report highlights the irony of these companies hiring lower-paid tech workers from foreign countries while laying off employees in the US.\n            </p><p>\n                99 Points |  <a href=\"https://news.ycombinator.com/item?id=37444386\">90 comments</a>\n            </p>",
            "url": "https://www.moneycontrol.com/europe/?url=https://www.moneycontrol.com/news/trends/layoffs-google-microsoft-meta-amazon-hiring-low-paid-h1b-workers-after-us-layoffs-report-10605301.html",
            "title": "Google, Meta, Amazon hiring low-paid H1B workers after US layoffs (www.moneycontrol.com)",
            "summary": "'Top Silicon Valley Companies Hiring Low-Paid H1B Workers After US Layoffs: Report'",
            "date_modified": "2023-09-09T12:06:48.000Z",
            "author": {
                "name": "www.moneycontrol.com"
            }
        },
        {
            "id": "https://foundation.mozilla.org/en/blog/privacy-nightmare-on-wheels-every-car-brand-reviewed-by-mozilla-including-ford-volkswagen-and-toyota-flunks-privacy-test/",
            "content_html": "<p>foundation.mozilla.org is checking the security of the site connection before proceeding. The site is using Cloudflare for performance and security. The Ray ID provided is 803e9d349f7b16a8.\n            </p><p>\n                214 Points |  <a href=\"https://news.ycombinator.com/item?id=37443644\">97 comments</a>\n            </p>",
            "url": "https://foundation.mozilla.org/en/blog/privacy-nightmare-on-wheels-every-car-brand-reviewed-by-mozilla-including-ford-volkswagen-and-toyota-flunks-privacy-test/",
            "title": "Privacy Nightmare on Wheels’: Every Car Brand Reviewed by Mozilla (foundation.mozilla.org)",
            "summary": "foundation.mozilla.org Checking Site Connection Security with Cloudflare",
            "date_modified": "2023-09-09T09:39:44.000Z",
            "author": {
                "name": "foundation.mozilla.org"
            }
        },
        {
            "id": "http://cm.bell-labs.co/who/dmr/chist.html",
            "content_html": "<p>This paper discusses the development of the C programming language, its influences, and the conditions under which it was created. It highlights the evolution of C from its parent language BCPL and its grandparent language BCPL. The paper also mentions the significant periods of changes in the language and its association with the Unix operating system. It concludes by noting that C has become one of the dominant languages in the computer industry today.\n            </p><p>\n                84 Points |  <a href=\"https://news.ycombinator.com/item?id=37442810\">10 comments</a>\n            </p>",
            "url": "http://cm.bell-labs.co/who/dmr/chist.html",
            "title": "The Development of the C Language (2003) (cm.bell-labs.co)",
            "summary": "'The Development and Evolution of the C Programming Language'",
            "date_modified": "2023-09-09T06:33:32.000Z",
            "author": {
                "name": "cm.bell-labs.co"
            }
        },
        {
            "id": "https://www.nytimes.com/2023/09/08/business/appeals-court-first-amendment-social-media.html",
            "content_html": "<p>A federal appeals court ruled that the Biden administration likely violated the First Amendment by pressuring social media platforms to remove misleading or false content about Covid-19. The court found that the White House and other government agencies had coerced the platforms and influenced their decision-making processes. The ruling narrows the scope of a preliminary injunction, limiting its impact to the White House, the Surgeon General's Office, the FBI, and the CDC. This decision is seen as a significant victory for free speech in the internet age.\n            </p><p>\n                31 Points |  <a href=\"https://news.ycombinator.com/item?id=37444340\">14 comments</a>\n            </p>",
            "url": "https://www.nytimes.com/2023/09/08/business/appeals-court-first-amendment-social-media.html",
            "title": "Appeals Court Rules White House Overstepped First Amendment on Social Media (www.nytimes.com)",
            "summary": "'Appeals Court Rules Biden Administration Overstepped First Amendment on Social Media'",
            "date_modified": "2023-09-09T11:58:48.000Z",
            "author": {
                "name": "www.nytimes.com"
            }
        },
        {
            "id": "https://discourse.julialang.org/t/julia-mojo-mandelbrot-benchmark/103638",
            "content_html": "<p>Julia code for calculating the Mandelbrot set is benchmarked against Mojo code. The Julia code takes 7.45 ms to run, while the Mojo code runs in 2.14 ms. Suggestions are made to improve the Julia code, such as using SIMD vectorization and decomposing complex numbers. The @simd macro is limited and cannot see through function calls. Differences between the Julia and Mojo code, such as the use of FP ranges, may also affect performance. Overall, the goal is to optimize the Julia code and potentially surpass the performance of the Mojo code.\n            </p><p>\n                137 Points |  <a href=\"https://news.ycombinator.com/item?id=37442064\">84 comments</a>\n            </p>",
            "url": "https://discourse.julialang.org/t/julia-mojo-mandelbrot-benchmark/103638",
            "title": "Julia and Mojo Mandelbrot Benchmark (discourse.julialang.org)",
            "summary": "Optimizing Julia Code for Mandelbrot Set Calculation",
            "date_modified": "2023-09-09T03:42:53.000Z",
            "author": {
                "name": "discourse.julialang.org"
            }
        },
        {
            "id": "https://www.sfgate.com/cannabis/article/3-republicans-saved-california-magic-mushroom-bill-18354895.php",
            "content_html": "<p>The user is being prompted to confirm their humanity by pressing and holding a button. If they are experiencing any issues, a reference ID is provided for troubleshooting purposes.\n            </p><p>\n                11 Points |  <a href=\"https://news.ycombinator.com/item?id=37444631\">1 comments</a>\n            </p>",
            "url": "https://www.sfgate.com/cannabis/article/3-republicans-saved-california-magic-mushroom-bill-18354895.php",
            "title": "Republicans just saved California’s magic mushroom bill (www.sfgate.com)",
            "summary": "Confirming Humanity: Press & Hold to Verify",
            "date_modified": "2023-09-09T12:38:00.000Z",
            "author": {
                "name": "www.sfgate.com"
            }
        },
        {
            "id": "https://skio.com/careers/",
            "content_html": "<p>Skio is a startup that helps brands on Shopify sell subscriptions and stands out with its transaction fee business model. The company has a flat organizational structure, minimal meeting culture, and a big long-term vision for building network effects. The founder, Kennan, has a track record of success and an EV-based decision-making approach. Skio is currently hiring for various positions in engineering, product, sales, customer experience, growth, and more.\n            </p><p>\n                1 Points |  <a href=\"https://news.ycombinator.com/item?id=37444354\">0 comments</a>\n            </p>",
            "url": "https://skio.com/careers/",
            "title": "Skio (YC S20) – Subscriptions for Shopify, ReCharge Migrations Is Hiring (skio.com)",
            "summary": "'Skio: A Startup Helping Brands Sell Subscriptions on Shopify with a Unique Business Model'",
            "date_modified": "2023-09-09T12:01:05.000Z",
            "author": {
                "name": "skio.com"
            }
        },
        {
            "id": "https://www.theguardian.com/science/2023/sep/07/nishimura-comet-could-be-visible-to-naked-eye-this-weekend",
            "content_html": "<p>Comet Nishimura, discovered just a month ago, could be visible to the naked eye this weekend, offering stargazers a rare opportunity. Most comets are discovered months or years before reaching peak visibility, but Nishimura is an exception. It swings by the sun every 437 years and spends most of its time in the outer solar system. The comet will pass closest to the sun on September 17th and will be easiest to observe in the northern hemisphere this Saturday and Sunday. Stargazers can look towards the north-eastern sky before sunrise, to the left of Venus, for the best view.\n            </p><p>\n                131 Points |  <a href=\"https://news.ycombinator.com/item?id=37413387\">81 comments</a>\n            </p>",
            "url": "https://www.theguardian.com/science/2023/sep/07/nishimura-comet-could-be-visible-to-naked-eye-this-weekend",
            "title": "Newly discovered comet Nishimura could be visible to naked eye this weekend (www.theguardian.com)",
            "summary": "Newly Discovered Comet Nishimura Could Be Visible to Naked Eye This Weekend",
            "date_modified": "2023-09-07T00:48:16.000Z",
            "author": {
                "name": "www.theguardian.com"
            }
        },
        {
            "id": "https://datavirke.dk/posts/bare-metal-kubernetes-part-1-talos-on-hetzner/",
            "content_html": "<p>The author shares their experience of running a Kubernetes cluster on a mix of virtual and bare metal machines with Hetzner. They decide to rebuild the cluster from scratch and document the process in a series of blog posts. The first part covers provisioning the first server, installing Talos Linux, and configuration and bootstrapping.\n            </p><p>\n                13 Points |  <a href=\"https://news.ycombinator.com/item?id=37443404\">1 comments</a>\n            </p>",
            "url": "https://datavirke.dk/posts/bare-metal-kubernetes-part-1-talos-on-hetzner/",
            "title": "Bare-Metal Kubernetes, Part I: Talos on Hetzner (datavirke.dk)",
            "summary": "Building a Kubernetes Cluster with Talos on Hetzner: Part I",
            "date_modified": "2023-09-09T08:44:52.000Z",
            "author": {
                "name": "datavirke.dk"
            }
        },
        {
            "id": "https://devblogs.microsoft.com/oldnewthing/20230904-00/?p=108704",
            "content_html": "<p>When shifting a register by more than its size, different processor architectures exhibit different behaviors. The table provided in the article shows the behavior of various processors, including the 8086, Alpha AXP, x86-64, MIPS, PowerPC, and more. The article also mentions that the C and C++ languages leave the behavior undefined when shifting by more than the bit width of the shifted type.\n            </p><p>\n                31 Points |  <a href=\"https://news.ycombinator.com/item?id=37426598\">11 comments</a>\n            </p>",
            "url": "https://devblogs.microsoft.com/oldnewthing/20230904-00/?p=108704",
            "title": "What happens when you shift a register by more than the register size? (devblogs.microsoft.com)",
            "summary": "Different Processor Architectures Behave Differently When Shifting Registers",
            "date_modified": "2023-09-07T22:39:13.000Z",
            "author": {
                "name": "devblogs.microsoft.com"
            }
        },
        {
            "id": "https://news.ycombinator.com/item?id=37444184",
            "content_html": "<p>No summary available\n            </p><p>\n                28 Points |  <a href=\"https://news.ycombinator.com/item?id=37444184\">12 comments</a>\n            </p>",
            "url": "https://news.ycombinator.com/item?id=37444184",
            "title": "Ask HN: Looking for a resource on Linux kernel module development (news.ycombinator.com)",
            "date_modified": "2023-09-09T11:32:06.000Z",
            "author": {
                "name": "news.ycombinator.com"
            }
        },
        {
            "id": "https://www.washingtonpost.com/obituaries/2023/09/08/dennis-austin-software-developer-powerpoint-dies/",
            "content_html": "<p>Dennis Austin, the principal software developer of PowerPoint, has passed away at the age of 76. Austin played a significant role in shaping how information is communicated in modern society through the development of PowerPoint. The software, which was released in 1987, revolutionized the creation of slides and became a ubiquitous tool in offices, classrooms, and government agencies. Despite its widespread use, PowerPoint has also faced criticism for its potential to create mind-numbing presentations filled with bullet points. Austin's contributions to the software were instrumental in its success.\n            </p><p>\n                29 Points |  <a href=\"https://news.ycombinator.com/item?id=37444257\">18 comments</a>\n            </p>",
            "url": "https://www.washingtonpost.com/obituaries/2023/09/08/dennis-austin-software-developer-powerpoint-dies/",
            "title": "Dennis Austin, the software developer of PowerPoint, dies at 76 (www.washingtonpost.com)",
            "summary": "'Dennis Austin, Principal Software Developer of PowerPoint, Dies at 76'",
            "date_modified": "2023-09-09T11:42:16.000Z",
            "author": {
                "name": "www.washingtonpost.com"
            }
        },
        {
            "id": "https://course.spacy.io/en/",
            "content_html": "<p>This course on spaCy, a Python library for Natural Language Processing, covers the basics of text processing, large-scale data analysis, processing pipelines, and training neural network models. It teaches you how to extract specific information from text, combine statistical and rule-based approaches, customize spaCy's models, and build advanced natural language understanding systems. The course is free and interactive, and is taught by Ines, one of the core developers of spaCy. She specializes in modern developer tools for AI, Machine Learning, and NLP.\n            </p><p>\n                62 Points |  <a href=\"https://news.ycombinator.com/item?id=37442574\">22 comments</a>\n            </p>",
            "url": "https://course.spacy.io/en/",
            "title": "Advanced NLP with SpaCy (course.spacy.io)",
            "summary": "Mastering Natural Language Processing with spaCy",
            "date_modified": "2023-09-09T05:36:22.000Z",
            "author": {
                "name": "course.spacy.io"
            }
        },
        {
            "id": "https://krebsonsecurity.com/",
            "content_html": "<p>Security experts believe that hackers have successfully cracked open some of the stolen LastPass vaults, leading to a series of cryptocurrency heists targeting security-conscious individuals. The victims, who were all longtime cryptocurrency investors, had one common factor: they had previously used LastPass to store their 'seed phrase,' the private key needed to access their cryptocurrency investments. The stolen funds were moved to the same blockchain addresses, allowing researchers to link the thefts and identify over 150 victims who lost more than $35 million in crypto. LastPass declined to comment on the research.\n            </p><p>\n                16 Points |  <a href=\"https://news.ycombinator.com/item?id=37442927\">4 comments</a>\n            </p>",
            "url": "https://krebsonsecurity.com/",
            "title": "Experts fear crooks are cracking keys stolen in LastPass breach (krebsonsecurity.com)",
            "summary": "'Experts Fear Crooks are Cracking Keys Stolen in LastPass Breach'",
            "date_modified": "2023-09-09T07:04:40.000Z",
            "author": {
                "name": "krebsonsecurity.com"
            }
        },
        {
            "id": "https://news.ycombinator.com/item?id=37444607",
            "content_html": "<p>No summary available\n            </p><p>\n                10 Points |  <a href=\"https://news.ycombinator.com/item?id=37444607\">4 comments</a>\n            </p>",
            "url": "https://news.ycombinator.com/item?id=37444607",
            "title": "U.S. Government Is Monitoring All Global Entry Members Daily (news.ycombinator.com)",
            "date_modified": "2023-09-09T12:36:00.000Z",
            "author": {
                "name": "news.ycombinator.com"
            }
        },
        {
            "id": "https://www.smithsonianmag.com/science-nature/math-card-game-spot-it-180970873/",
            "content_html": "<p>Spot It!, the popular family card game, is based on complex mathematics. The game's structure, where every card has one matching symbol with any other card, is rooted in the logic puzzles of 19th-century mathematicians. The game's origins can be traced back to the Reverend Thomas Penyngton Kirkman's Schoolgirl Problem, a question of combinatorics. The general solution to this problem was not figured out until 1968, and it has since found applications in various fields, including card games like Spot It!\n            </p><p>\n                42 Points |  <a href=\"https://news.ycombinator.com/item?id=37414659\">11 comments</a>\n            </p>",
            "url": "https://www.smithsonianmag.com/science-nature/math-card-game-spot-it-180970873/",
            "title": "The Mind-Bending Math Behind Spot It (2018) (www.smithsonianmag.com)",
            "summary": "'Spot It!' Card Game: The Math Behind the Matching Symbols",
            "date_modified": "2023-09-07T04:08:50.000Z",
            "author": {
                "name": "www.smithsonianmag.com"
            }
        },
        {
            "id": "https://icfp23.sigplan.org/details/ocaml-2023-papers/5/Eio-1-0-Effects-based-IO-for-OCaml-5",
            "content_html": "<p>This session at ICFP 2023 will discuss Eio 1.0, an effects-based IO stack for OCaml 5. The talk will cover its main features, including multi-core support, lock-free data structures, modular programming, interoperability with other concurrency libraries, and interactive monitoring support. The speakers will also share their experiences in porting existing applications to Eio.\n            </p><p>\n                7 Points |  <a href=\"https://news.ycombinator.com/item?id=37443395\">0 comments</a>\n            </p>",
            "url": "https://icfp23.sigplan.org/details/ocaml-2023-papers/5/Eio-1-0-Effects-based-IO-for-OCaml-5",
            "title": "Eio 1.0 – Effects-based IO for OCaml 5 (icfp23.sigplan.org)",
            "summary": "'Eio 1.0 - Effects-based IO for OCaml 5' to be Presented at ICFP 2023",
            "date_modified": "2023-09-09T08:44:07.000Z",
            "author": {
                "name": "icfp23.sigplan.org"
            }
        },
        {
            "id": "https://news.ycombinator.com/item?id=37444477",
            "content_html": "<p>No summary available\n            </p><p>\n                10 Points |  <a href=\"https://news.ycombinator.com/item?id=37444477\">0 comments</a>\n            </p>",
            "url": "https://news.ycombinator.com/item?id=37444477",
            "title": "CRISPR used to 'reprogram' cancer cells into healthy muscle in the lab (news.ycombinator.com)",
            "date_modified": "2023-09-09T12:20:20.000Z",
            "author": {
                "name": "news.ycombinator.com"
            }
        },
        {
            "id": "https://www.newyorker.com/culture/personal-history/the-power-of-food-for-people-with-dementia",
            "content_html": "<p>The Power of Food in Triggering Memories and Enhancing Quality of Life for People with Dementia\n            </p><p>\n                71 Points |  <a href=\"https://news.ycombinator.com/item?id=37413566\">12 comments</a>\n            </p>",
            "url": "https://www.newyorker.com/culture/personal-history/the-power-of-food-for-people-with-dementia",
            "title": "The Power of Food for People with Dementia (www.newyorker.com)",
            "summary": "The Transformative Role of Food for Individuals with Dementia",
            "date_modified": "2023-09-07T01:15:10.000Z",
            "author": {
                "name": "www.newyorker.com"
            }
        },
        {
            "id": "https://blog.dataparty.xyz/blog/snoop-unto-them/",
            "content_html": "<p>DEFCON 31 has released official videos of their talks, including 'Snoop unto them as they snoop unto you'. The talk, slides, files, and code are available for download. The blog post also provides links to follow and support the speakers, including options to buy them a coffee, get their rfparty product, and connect on social media. The post ends with an invitation to join their Discord and sign up for their mailing list.\n            </p><p>\n                196 Points |  <a href=\"https://news.ycombinator.com/item?id=37440104\">112 comments</a>\n            </p>",
            "url": "https://blog.dataparty.xyz/blog/snoop-unto-them/",
            "title": "Snoop unto them as they snoop unto you (blog.dataparty.xyz)",
            "summary": "'DEFCON 31 Releases Official Videos and Offers Ways to Support Speakers'",
            "date_modified": "2023-09-08T22:26:51.000Z",
            "author": {
                "name": "blog.dataparty.xyz"
            }
        },
        {
            "id": "https://ecl.common-lisp.dev/posts/ECL-2399-release.html",
            "content_html": "<p>The ECL developers have announced the release of ECL 23.9.9, a stable version of Embeddable Common-Lisp. This release includes bug fixes, new features, improvements to the compiler, and better conformance to the ANSI standard. Notable changes include an overhaul of thread synchronization primitives, better unicode support, and preliminary support for the Emscripten target. The release is available for download as a source code archive.\n            </p><p>\n                45 Points |  <a href=\"https://news.ycombinator.com/item?id=37442649\">10 comments</a>\n            </p>",
            "url": "https://ecl.common-lisp.dev/posts/ECL-2399-release.html",
            "title": "Embeddable Common Lisp 23.9.9 (ecl.common-lisp.dev)",
            "summary": "'Embeddable Common-Lisp 23.9.9 Released with Bug Fixes and New Features'",
            "date_modified": "2023-09-09T05:56:03.000Z",
            "author": {
                "name": "ecl.common-lisp.dev"
            }
        },
        {
            "id": "https://msprout.notion.site/LogoScale-A-Method-for-Vectorizing-Small-Crappy-Logos-dc0035b7473c44f8b94ffc4026d286c0",
            "content_html": "<p>N/A\n            </p><p>\n                149 Points |  <a href=\"https://news.ycombinator.com/item?id=37440631\">23 comments</a>\n            </p>",
            "url": "https://msprout.notion.site/LogoScale-A-Method-for-Vectorizing-Small-Crappy-Logos-dc0035b7473c44f8b94ffc4026d286c0",
            "title": "LogoScale – A method for vectorizing small, crappy logos (msprout.notion.site)",
            "summary": "N/A",
            "date_modified": "2023-09-08T23:38:39.000Z",
            "author": {
                "name": "msprout.notion.site"
            }
        },
        {
            "id": "https://timotijhof.net/posts/2023/an-internet-of-php/",
            "content_html": "<p>PHP Continues to Dominate the Internet: Statistics and Anecdotes\n            </p><p>\n                200 Points |  <a href=\"https://news.ycombinator.com/item?id=37415747\">181 comments</a>\n            </p>",
            "url": "https://timotijhof.net/posts/2023/an-internet-of-php/",
            "title": "An Internet of PHP (timotijhof.net)",
            "summary": "PHP's Dominance in the Internet: Statistics and Anecdotes",
            "date_modified": "2023-09-07T07:23:33.000Z",
            "author": {
                "name": "timotijhof.net"
            }
        },
        {
            "id": "https://bills.parliament.uk/publications/46675/documents/1885",
            "content_html": "<p>The website bills.parliament.uk is checking the security of the user's connection before proceeding. It is using Cloudflare for performance and security. The Ray ID provided is 803f9d175da16464.\n            </p><p>\n                17 Points |  <a href=\"https://news.ycombinator.com/item?id=37443634\">1 comments</a>\n            </p>",
            "url": "https://bills.parliament.uk/publications/46675/documents/1885",
            "title": "Google's Statement on the UK Online Safety Bill (bills.parliament.uk)",
            "summary": "Security Check on bills.parliament.uk",
            "date_modified": "2023-09-09T09:36:58.000Z",
            "author": {
                "name": "bills.parliament.uk"
            }
        },
        {
            "id": "https://en.wikipedia.org/wiki/Burakumin",
            "content_html": "<p>Burakumin refers to ethnic Japanese people who are believed to be descended from pre-Meiji castes associated with defilement. These occupations acquired a hereditary status of untouchability during Japan's feudal era. After the caste system was abolished, the term burakumin came into use to refer to former caste members and their descendants who continued to face discrimination. The article explores the historical origins, social issues, and discrimination faced by the burakumin community in Japan.\n            </p><p>\n                3 Points |  <a href=\"https://news.ycombinator.com/item?id=37414664\">1 comments</a>\n            </p>",
            "url": "https://en.wikipedia.org/wiki/Burakumin",
            "title": "Burakumin - \"Hamlet people\" of Japan (en.wikipedia.org)",
            "summary": "'Burakumin': The Descendants of Pre-Meiji Castes and Their Struggle Against Discrimination",
            "date_modified": "2023-09-07T04:09:45.000Z",
            "author": {
                "name": "en.wikipedia.org"
            }
        },
        {
            "id": "https://www.nytimes.com/2023/09/09/arts/music/talking-heads-stop-making-sense.html",
            "content_html": "<p>'Stop Making Sense' is a concert documentary by Talking Heads that has been restored for its 40th anniversary. The film, directed by Jonathan Demme, will premiere at the Toronto International Film Festival and then be shown in theaters. The documentary captures the band's unique staging and eclectic music, which blended rock, funk, and African rhythms. The restoration includes an expanded audio album with the full concert set. The film is considered a landmark achievement and a prophetic piece of art.\n            </p><p>\n                7 Points |  <a href=\"https://news.ycombinator.com/item?id=37444113\">1 comments</a>\n            </p>",
            "url": "https://www.nytimes.com/2023/09/09/arts/music/talking-heads-stop-making-sense.html",
            "title": "‘Stop Making Sense’ Is Back, and Talking Heads Have More to Say (www.nytimes.com)",
            "summary": "'Stop Making Sense' Concert Documentary Restored for 40th Anniversary",
            "date_modified": "2023-09-09T11:20:24.000Z",
            "author": {
                "name": "www.nytimes.com"
            }
        },
        {
            "id": "https://www.libraryofshortstories.com/",
            "content_html": "<p>Discover and read over 1000 classic short stories for free on an online library. Search, sort, and filter stories by genre, theme, or popularity. Find stories from various authors and explore different collections. The website offers a wide range of genres, including adventure, horror, mystery, poetry, and more. It also provides further reading and privacy information.\n            </p><p>\n                8 Points |  <a href=\"https://news.ycombinator.com/item?id=37442922\">1 comments</a>\n            </p>",
            "url": "https://www.libraryofshortstories.com/",
            "title": "Library of Short Stories – An online library of public domain short stories (www.libraryofshortstories.com)",
            "summary": "Explore a Vast Online Library of Classic Short Stories",
            "date_modified": "2023-09-09T07:02:21.000Z",
            "author": {
                "name": "www.libraryofshortstories.com"
            }
        },
        {
            "id": "https://andjelicaaa.substack.com/p/creative-money-aesthetics",
            "content_html": "<p>The Creative Class, consisting of creators, curators, critics, and hangers-on, has a distinct aesthetic that blends businesswear with vintage, sports wear, and work wear. They treat their job as leisure and their leisure as job, reflecting a cool, nonchalant, versatile, durable, and comfortable style. The Creative Class accumulates cultural capital by commenting, repurposing, and reinterpreting past and present culture, creating something modern and new while maintaining familiarity. They play a critical role in the modern economy by directing consumers' time, attention, and money towards aspirational things, places, and ideas.\n            </p><p>\n                4 Points |  <a href=\"https://news.ycombinator.com/item?id=37416882\">0 comments</a>\n            </p>",
            "url": "https://andjelicaaa.substack.com/p/creative-money-aesthetics",
            "title": "Creative Money Aesthetics (andjelicaaa.substack.com)",
            "summary": "The Aesthetic and Influence of the Creative Class in Business",
            "date_modified": "2023-09-07T10:18:43.000Z",
            "author": {
                "name": "andjelicaaa.substack.com"
            }
        },
        {
            "id": "https://www.sciencedirect.com/science/article/pii/S0016706123003324#s0040",
            "content_html": "<p>The content you requested is not available. Please contact support for more information. The reference number, IP address, and timestamp are provided for reference. ScienceDirect uses cookies to enhance its service. Copyright information is also included.\n            </p><p>\n                74 Points |  <a href=\"https://news.ycombinator.com/item?id=37440482\">11 comments</a>\n            </p>",
            "url": "https://www.sciencedirect.com/science/article/pii/S0016706123003324#s0040",
            "title": "Morphology and temporal evolution of ground-nesting bee burrows (www.sciencedirect.com)",
            "summary": "Content Unavailable: Contact Support for Assistance",
            "date_modified": "2023-09-08T23:17:21.000Z",
            "author": {
                "name": "www.sciencedirect.com"
            }
        }
    ]
}